let inventory = []
const StartItem = [oldSword, flashlight, bones]
let Luck = Math.random(1, 2)

alert('Вы попали в темный дубовый лес, вокруг вас высокие деревья, за каждым кустом бродят голодные волки и скоро наступит ночь...')
const PickOut = confirm('Под одним из деревьев лежал фонарь и поломанный меч, а рядом стоит скелет. Рискнете ли вы подобрать мечь и фонарь?(шанс убить скелета 50%)')

if (PickOut) {
    Luck = Math.random(1, 2)
    if (Luck == 1) {
        
        alert('Скелет оказался сильнее, вам нужно бежать, но вы можете взять фонарь или поломанный мечь. Что вы выберете? \n  1 - Меч \n 2 - Фонарь')
        if()
    }
    else {

    }
}